{
    "title": "Nonogram World",
    "header": {
        "logo": "Nonogram World",
        "login": "Login"
    },
    "nav": {
        "play": "Play",
        "map": "Expedition (coming soon)",
        "daily": "Daily Puzzle",
        "rules": "Rules",
        "forum": "Forum",
        "leaderboard": "Leaderboard"
    },
    "game": {
        "title": "Nonograms: Level 1",
        "difficulty": "Difficulty: Easy",
        "restart": "↺ Restart",
        "check": "✓ Check",
        "canvas_placeholder": "Canvas Game Board"
    },
    "panel": {
        "progress": "Progress",
        "how_to_play": "How to Play",
        "tools": "Tools",
        "like_game": "Enjoying the game?",
        "share": "Share with friends"
    },
    "stats": {
        "time": "Time",
        "lives": "Lives",
        "solved": "Solved"
    },
    "controls": {
        "lmb": "LMB",
        "paint": "Fill cell",
        "rmb": "RMB",
        "cross": "Mark cross",
        "drag": "Drag",
        "draw": "Draw by dragging"
    },
    "tools": {
        "lamp": "💡 Hint",
        "settings": "⚙️ Settings",
        "next_level": "Next Level ➜"
    },
    "footer": {
        "copy": "&copy; 2026 Nonogram World. All rights reserved.",
        "privacy": "Privacy Policy",
        "terms": "Terms of Use",
        "contacts": "Contacts",
        "daily_title": "Daily Challenge",
        "daily_reward": "Daily Reward! +{{coins}} 🪙",
        "daily_solved": "Already Solved",
        "version": "Version: 0.1.018"
    },
    "rules_detail": {
        "title": "How to Solve Nonograms",
        "intro_p1": "Nonograms (also known as Griddlers or Japanese Crosswords) are picture logic puzzles where you must decode a hidden image using numbers placed along the edges of the grid. Each number represents the length of a continuous block of filled cells in that specific row or column. A fundamental rule is that there must be at least one empty (unfilled) cell separating any two adjacent blocks of filled cells.",
        "intro_p2": "The solving process is based on strict deduction: you analyze the intersections of horizontal and vertical lines, gradually filling in cells that must logically be shaded. The game is considered complete when all numerical requirements are met, revealing a silhouette or a pixel-art image. Nonograms do not require guessing; any well-designed puzzle has only one logically correct solution that can be found through the process of elimination.",
        "tips_title": "Tips and Strategies for Success",
        "tips": {
            "tip1_title": "Start with the Largest Numbers",
            "tip1_text": "If a number in a row matches the full width or height of the grid, fill it in entirely without hesitation.",
            "tip2_title": "Use the Overlap Method",
            "tip2_text": "If the sum of the numbers in a row (plus the mandatory gaps) covers more than half the length, you can calculate the 'overlap' cells that will be filled regardless of the exact placement.",
            "tip3_title": "Mark Empty Cells with 'X's",
            "tip3_text": "This is absolutely critical. As soon as you determine a cell cannot be filled, mark it with an 'X' to narrow down your search area.",
            "tip4_title": "Look for 'Zero' Rows",
            "tip4_text": "If a row or column has a '0' or no numbers at all, immediately cross out the entire line with 'X's.",
            "tip5_title": "Anchor the Edges",
            "tip5_text": "If a filled cell is located right against the edge of the grid, it must be part of the first (or last) number group for that row or column.",
            "tip6_title": "Cross Off Completed Numbers",
            "tip6_text": "Once you have fully formed a block of cells corresponding to a number, cross that number off your clue list to stay organized.",
            "tip7_title": "Seal Your Blocks",
            "tip7_text": "Once a group of cells is completed, place an 'X' on both ends of it to prevent the block from accidentally being extended.",
            "tip8_title": "Use the Elimination Method",
            "tip8_text": "If a specific number group cannot physically fit into a remaining gap, you know that space must be empty.",
            "tip9_title": "Check Intersections",
            "tip9_text": "Every cell you fill in a row must simultaneously satisfy the rules of its intersecting column.",
            "tip10_title": "Never Guess",
            "tip10_text": "A single mistake early on can ruin the entire logical chain. If you are stuck, look for a clue elsewhere on the board.",
            "tip11_title": "Work Inward from the Borders",
            "tip11_text": "It is often easiest to find hooks in the corner cells or the outermost rows, as they have the fewest placement options.",
            "tip12_title": "Identify Unreachable Gaps",
            "tip12_text": "If the distance between two filled cells is smaller than the minimum block size required for that row, those cells cannot be connected.",
            "tip13_title": "Separate Your Blocks",
            "tip13_text": "If there is an 'X' between two filled sections, it guarantees they belong to different number clues.",
            "tip14_title": "Look for Impossible Positions",
            "tip14_text": "If placing a block in a certain spot creates a contradiction in the perpendicular row, that spot must be marked as empty.",
            "tip15_title": "Move from Simple to Complex",
            "tip15_text": "Fill in the obvious rows first (e.g., a '10' in a 10-cell row), then move on to analyzing smaller, more ambiguous numbers.",
            "tip16_title": "Notice Symmetry",
            "tip16_text": "Many simple nonograms are symmetrical; while you shouldn't rely on it entirely, it can often point you in the right direction.",
            "tip17_title": "Calculate Total Length",
            "tip17_text": "Always remember the 'minimum length' of a row is the sum of all its numbers plus one empty space between each.",
            "tip18_title": "Marking Empty Cells Organizes Chaos",
            "tip18_text": "Without 'X' marks, the board becomes visually cluttered, making it impossible to accurately judge the remaining playable space."
        },
        "back": "Return to the game"
    },
    "privacy_detail": {
        "title": "Privacy Policy",
        "intro": "We respect your privacy and are committed to protecting your personal data. This policy explains how we process information.",
        "h1_title": "1. Information Collection",
        "h1_p": "Our application works primarily on the client side. We do not collect personal data such as your name or email address without your explicit consent.",
        "h2_title": "2. Data Usage",
        "h2_p": "We use the browser's local storage (localStorage) to remember your settings, such as:",
        "h2_li1": "Selected color theme (light/dark).",
        "h2_li2": "Your game progress.",
        "h2_li3": "The number of game coins.",
        "h3_title": "3. Cookies",
        "h3_p": "We may use cookies for analytics to understand how users interact with Nonogram World and make it better.",
        "h4_title": "4. Third-party services",
        "h4_p": "The game may use external APIs (e.g., Google Gemini) to generate game content. No personal information is transmitted to these services."
    },
    "terms_detail": {
        "title": "Terms of Use",
        "intro": "Welcome to Nonogram World. By using this site, you agree to the following terms.",
        "h1_title": "1. Acceptance of Terms",
        "h1_p": "By accessing the site and using the game, you confirm that you have read, understood, and agree to comply with these rules.",
        "h2_title": "2. Gameplay",
        "h2_p": "The game is provided 'as is'. We are not responsible for the safety of your progress data in case of clearing the browser cache or storage.",
        "h3_title": "3. Fair Play",
        "h3_p": "We welcome fair play. The use of third-party software to automate nonogram solving is discouraged, as it deprives the puzzle itself of meaning.",
        "h4_title": "4. Changes",
        "h4_p": "We reserve the right to change these terms and game functionality at any time without prior notice."
    },
    "contacts_detail": {
        "title": "Contacts",
        "intro": "Do you have questions, suggestions, or found a bug in the game? We are always happy for feedback!",
        "methods_title": "Ways to reach us",
        "email_label": "Email:",
        "github_label": "GitHub:",
        "feedback_time": "We try to respond to all inquiries within 24 hours."
    },
    "subscription": {
        "title": "Leave your email and we'll let you know when the expedition is ready!",
        "placeholder": "Email",
        "button": "Send",
        "sending": "Sending...",
        "success": "Thank you! We will contact you.",
        "error": "Sending error. Please try again later."
    }
}