{
    "title": "Nonogram World",
    "header": {
        "logo": "Nonogram World",
        "login": "Войти"
    },
    "nav": {
        "play": "Играть",
        "map": "Экспедиция (скоро)",
        "daily": "Головоломка дня",
        "rules": "Правила",
        "forum": "Форум",
        "leaderboard": "Таблица лидеров"
    },
    "game": {
        "title": "Нонограммы: Уровень 1",
        "difficulty": "Сложность: Легко",
        "restart": "↺ Заново",
        "check": "✓ Проверить",
        "canvas_placeholder": "Игровое поле Canvas"
    },
    "panel": {
        "progress": "Прогресс",
        "how_to_play": "Как играть",
        "tools": "Инструменты",
        "like_game": "Нравится игра?",
        "share": "Поделиться с друзьями"
    },
    "stats": {
        "time": "Время",
        "lives": "Жизни",
        "solved": "Решено"
    },
    "controls": {
        "lmb": "ЛКМ",
        "paint": "Закрасить клетку",
        "rmb": "ПКМ",
        "cross": "Поставить крестик",
        "drag": "Drag",
        "draw": "Рисовать нажатием"
    },
    "tools": {
        "lamp": "💡 Лампа",
        "settings": "⚙️ Настройки",
        "next_level": "Следующий уровень ➜"
    },
    "footer": {
        "copy": "&copy; 2026 Nonogram World. Все права защищены.",
        "privacy": "Политика конфиденциальности",
        "terms": "Условия использования",
        "contacts": "Контакты",
        "daily_title": "Вызов дня",
        "daily_reward": "Бонус дня! +{{coins}} 🪙",
        "daily_solved": "Уже пройдено",
        "version": "Версия: 0.1.021"
    },
    "rules_detail": {
        "title": "Как разгадывать нонограммы",
        "intro_p1": "Нонограммы (также известные как Griddlers или японские кроссворды) — это логические головоломки с картинками, в которых вам нужно расшифровать скрытое изображение, используя числа, расположенные по краям сетки. Каждое число представляет собой длину непрерывного блока закрашенных клеток в этой конкретной строке или столбце. Фундаментальное правило заключается в том, что между любыми двумя соседними блоками закрашенных клеток должна быть как минимум одна пустая (незакрашенная) клетка.",
        "intro_p2": "Процесс решения основан на строгой дедукции: вы анализируете пересечения горизонтальных и вертикальных линий, постепенно заполняя клетки, которые по логике должны быть закрашены. Игра считается завершенной, когда все числовые требования выполнены, открывая силуэт или пиксельное изображение. Нонограммы не требуют угадывания; любая хорошо проработанная головоломка имеет только одно логически верное решение, которое можно найти методом исключения.",
        "tips_title": "Советы и стратегии для успеха",
        "tips": {
            "tip1_title": "Начните с самых больших чисел",
            "tip1_text": "Если число в строке совпадает с полной шириной или высотой сетки, заполняйте её целиком без колебаний.",
            "tip2_title": "Используйте метод перекрытия",
            "tip2_text": "Если сумма чисел в строке (плюс обязательные промежутки) составляет более половины длины, вы можете вычислить клетки «перекрытия», которые будут закрашены независимо от точного расположения.",
            "tip3_title": "Отмечайте пустые клетки крестиками (X)",
            "tip3_text": "Это критически важно. Как только вы определили, что клетка не может быть закрашена, отметьте её буквой «X», чтобы сузить область поиска.",
            "tip4_title": "Ищите «нулевые» строки",
            "tip4_text": "Если в строке или столбце стоит «0» или вообще нет цифр, немедленно вычеркните всю линию крестиками.",
            "tip5_title": "Закрепляйте края",
            "tip5_text": "Если закрашенная клетка находится прямо у края сетки, она должна быть частью первой (или последней) группы чисел для этой строки или столбца.",
            "tip6_title": "Вычеркивайте завершенные числа",
            "tip6_text": "Как только вы полностью сформируете блок клеток, соответствующий числу, вычеркните это число из списка подсказок, чтобы сохранять порядок.",
            "tip7_title": "«Запечатывайте» свои блоки",
            "tip7_text": "Как только группа клеток завершена, поставьте «X» с обоих её концов, чтобы предотвратить случайное расширение блока.",
            "tip8_title": "Используйте метод исключения",
            "tip8_text": "Если конкретная группа чисел физически не может поместиться в оставшийся промежуток, вы знаете, что это место должно быть пустым.",
            "tip9_title": "Проверяйте пересечения",
            "tip9_text": "Каждая клетка, которую вы заполняете в строке, должна одновременно удовлетворять правилам пересекающего её столбца.",
            "tip10_title": "Никогда не гадайте",
            "tip10_text": "Одна ошибка в самом начале может разрушить всю логическую цепочку. Если вы застряли, поищите подсказку в другом месте на доске.",
            "tip11_title": "Двигайтесь внутрь от границ",
            "tip11_text": "Часто проще всего найти зацепки в угловых клетках или самых крайних рядах, так как у них меньше всего вариантов размещения.",
            "tip12_title": "Выявляйте недоступные промежутки",
            "tip12_text": "Если расстояние между двумя закрашенными клетками меньше минимального размера блока, необходимого для этой строки, эти клетки не могут быть соединены.",
            "tip13_title": "Разделяйте свои блоки",
            "tip13_text": "Если между двумя закрашенными секциями стоит «X», это гарантирует, что они относятся к разным числовым подсказкам.",
            "tip14_title": "Ищите невозможные позиции",
            "tip14_text": "Если размещение блока в определенном месте создает противоречие в перпендикулярном ряду, это место должно быть отмечено как пустое.",
            "tip15_title": "Переходите от простого к сложному",
            "tip15_text": "Сначала заполните очевидные строки (например, «10» в 10-клеточной строке), затем переходите к анализу более мелких и неоднозначных чисел.",
            "tip16_title": "Замечайте симметрию",
            "tip16_text": "Многие простые нонограммы симметричны; хотя не стоит полагаться на это полностью, часто это может указать вам верное направление.",
            "tip17_title": "Рассчитывайте общую длину",
            "tip17_text": "Всегда помните, что «минимальная длина» строки — это сумма всех её чисел плюс один пробел между каждым.",
            "tip18_title": "Маркировка пустых клеток организует хаос",
            "tip18_text": "Без отметок «X» доска становится визуально загроможденной, что делает невозможным точную оценку оставшегося игрового пространства."
        },
        "back": "Вернуться к игре"
    },
    "privacy_detail": {
        "title": "Политика конфиденциальности",
        "intro": "Мы уважаем вашу конфиденциальность и стремимся защитить ваши персональные данные. Эта политика объясняет, как мы обрабатываем информацию.",
        "h1_title": "1. Сбор информации",
        "h1_p": "Наше приложение работает преимущественно на стороне клиента. Мы не собираем личные данные, такие как ваше имя или адрес электронной почты, без вашего явного согласия.",
        "h2_title": "2. Использование данных",
        "h2_p": "Мы используем локальное хранилище браузера (localStorage) для того, чтобы запомнить ваши настройки, такие как:",
        "h2_li1": "Выбранная цветовая тема (светлая/темная).",
        "h2_li2": "Ваш прогресс в игре.",
        "h2_li3": "Количество игровых монет.",
        "h3_title": "3. Файлы cookie",
        "h3_p": "Мы можем использовать файлы cookie для аналитики, чтобы понимать, как пользователи взаимодействуют с Nonogram World и делать его лучше.",
        "h4_title": "4. Сторонние сервисы",
        "h4_p": "Игра может использовать внешние API (например, Google Gemini) для генерации игрового контента. В эти сервисы не передается ваша личная информация."
    },
    "terms_detail": {
        "title": "Условия использования",
        "intro": "Добро пожаловать в Nonogram World. Используя этот сайт, вы соглашаетесь со следующими условиями.",
        "h1_title": "1. Принятие условий",
        "h1_p": "Заходя на сайт и используя игру, вы подтверждаете, что прочитали, поняли и согласны соблюдать данные правила.",
        "h2_title": "2. Игровой процесс",
        "h2_p": "Игра предоставляется «как есть». Мы не несем ответственности за сохранность данных вашего прогресса в случае очистки кэша или хранилища браузера.",
        "h3_title": "3. Честная игра",
        "h3_p": "Мы приветствуем честную игру. Использование стороннего ПО для автоматизации разгадывания нонограмм не приветствуется, так как это лишает смысла саму головоломку.",
        "h4_title": "4. Изменения",
        "h4_p": "Мы оставляем за собой право изменять данные условия и функционал игры в любое время без предварительного уведомления."
    },
    "contacts_detail": {
        "title": "Контакты",
        "intro": "У вас возникли вопросы, предложения или вы нашли ошибку в игре? Мы всегда рады обратной связи!",
        "methods_title": "Способы связи",
        "email_label": "Email:",
        "github_label": "GitHub:",
        "feedback_time": "Мы стараемся отвечать на все запросы в течение 24 часов."
    },
    "subscription": {
        "title": "Оставьте свою почту и мы дадим вам знать, когда экспедиция будет готова!",
        "placeholder": "Email",
        "button": "Отправить",
        "sending": "Отправка...",
        "success": "Спасибо! Мы свяжемся с вами.",
        "error": "Ошибка отправки. Попробуйте позже."
    }
}